In [2]:
from shapely.geometry import Point
import pandas as pd
import geopandas as gpd
import matplotlib.pyplot as plt
import folium
from folium.plugins import MarkerCluster
from folium.plugins import FastMarkerCluster
from sqlalchemy import create_engine

In [3]:
database_name = 'scooters'    # Fill this in with your scooter database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

engine = create_engine(connection_string)

In [ ]:
#### How to run querys
# query = '''
# SELECT latitude
# FROM scooters;
# '''

# result = engine.execute(query)

# lat = pd.read_sql(query, con = engine)
# lat.head()

In [8]:
query0 = '''
SELECT DISTINCT companyname
FROM scooters
LIMIT 100;
'''
companies = pd.read_sql(query0, con=engine)
companies

  companyname
0        Bird
1        Bolt
2      Gotcha
3        Jump
4        Lime
5        Lyft
6        Spin

- Are there any null values in any columns in either table?

In [10]:
query1 = '''
SELECT COUNT(pubdatetime)
FROM scooters
WHERE pubdatetime IS NULL
'''
nullval0 = pd.read_sql(query1, con = engine)
nullval0

   count
0      0

In [11]:
query2 = '''
SELECT COUNT(latitude)
FROM scooters
WHERE latitude IS NULL
'''
nullval1 = pd.read_sql(query2, con = engine)
nullval1

   count
0      0

In [12]:
query3 = '''
SELECT COUNT(longitude)
FROM scooters
WHERE longitude IS NULL
'''
nullval2 = pd.read_sql(query3, con = engine)
nullval2

   count
0      0

In [13]:
query4 = '''
SELECT COUNT(companyname)
FROM trips
WHERE companyname IS NULL
'''
nullval3 = pd.read_sql(query4, con = engine)
nullval3

   count
0      0

In [14]:
query5 = '''
SELECT *
FROM scooters
LIMIT 5
'''
tablelook0 = pd.read_sql(query5, con = engine)
tablelook0

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-31 18:31:03.723,36.158420,-86.776946,Powered027850,Powered,91.0,scooter,0.15,Lyft
1,2019-07-31 18:31:03.800,36.177672,-86.750072,Powered382538,Powered,98.0,scooter,0.15,Lyft
2,2019-07-31 18:31:03.840,36.156370,-86.809491,Powered014344,Powered,29.0,scooter,0.15,Lyft
3,2019-07-31 18:31:03.850,36.144842,-86.812498,Powered629248,Powered,90.0,scooter,0.15,Lyft
4,2019-07-31 18:31:03.917,36.162853,-86.783581,Powered890532,Powered,97.0,scooter,0.15,Lyft

- What date range is represented in each of the date columns? Investigate any values that seem odd.

In [16]:
thedates = '''
SELECT MIN(pubdatetime), MAX(pubdatetime)
FROM scooters
'''
datesscoot= pd.read_sql(thedates, con = engine)
datesscoot

                      min                 max
0 2019-05-01 00:01:41.247 2019-07-31 23:59:57

In [21]:
thedates1 = '''
SELECT MIN(startdate), MAX(enddate)
FROM trips
'''
datestrips= pd.read_sql(thedates1, con = engine)
datestrips

          min         max
0  2019-05-01  2019-08-01

- Is time represented with am/pm or using 24 hour values in each of the columns that include time?

In [24]:
time = '''
SELECT *
FROM trips
LIMIT 1
'''
times = pd.read_sql(time, con = engine)
times

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.1571,-86.8036,36.1566,-86.8067,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780

- What values are there in the sumdgroup column? Are there any that are not of interest for this project?

In [26]:
sumd = '''
SELECT sumdid
FROM trips
LIMIT 10
'''
sumdi = pd.read_sql(sumd, con = engine)
sumdi

          sumdid
0   Powered9EAJL
1  Powered296631
2   Powered7S2UU
3   PoweredZIIVX
4   PoweredJ7MB3
5   PoweredEJF1K
6  Powered329418
7  Powered438572
8   PoweredSX2AW
9   PoweredL968V

- What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?

In [ ]:
latlong = '''
SELECT '''